0/aboutMe.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3b2d849">ブログをつくりました。</a>
<ul>
<li><a href="#org0ed0557">なんで外部のホスティングサービスじゃだめなのか</a>
<ul>
<li><a href="#orgeaa6135">自分で管理することでの技術向上</a></li>
<li><a href="#org50e8684">リクエストログでのアクセス解析</a></li>
<li><a href="#org1fcd90e">広告運用</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb2215d4">自分について</a></li>
<li><a href="#org4e1809a">LICENSE</a></li>
<li><a href="#org31b3bda">POSIX-shell縛りのスクリプトでCMSを作ってみた。</a>
<ul>
<li><a href="#org81b328f">実行環境</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3b2d849" class="outline-2">
<h2 id="org3b2d849">ブログをつくりました。</h2>
<div class="outline-text-2" id="text-org3b2d849">
<p>
こんにちは。
</p>

<p>
このブログは僕が生産したことを残すためのブログです。
日々の生産を残すメディアがないと、自己紹介や就職、転職のときの話題提供ができなくなってしまうケースが多いなと感じて作りました。
</p>

<p>
プログラミングははじめて7年目くらいの初心者なので、記事の内容に間違いをみつけたら、どしどし指摘してください。。
そのうち、コメントとかの機能もつける予定。。。。
</p>
</div>

<div id="outline-container-org0ed0557" class="outline-3">
<h3 id="org0ed0557">なんで外部のホスティングサービスじゃだめなのか</h3>
<div class="outline-text-3" id="text-org0ed0557">
</div>
<div id="outline-container-orgeaa6135" class="outline-4">
<h4 id="orgeaa6135">自分で管理することでの技術向上</h4>
<div class="outline-text-4" id="text-orgeaa6135">
<p>
どこの人がいつ言っていたのか忘れましたが、運用せずに研究はできないって言葉を大切にしています。
インターネットの規格は実際に利用されるなかで柔軟に変化していくものであり、実際に運用しなければ気づかないことが多くあると考え自分で管理することにしました。
</p>
</div>
</div>

<div id="outline-container-org50e8684" class="outline-4">
<h4 id="org50e8684">リクエストログでのアクセス解析</h4>
<div class="outline-text-4" id="text-org50e8684">
<p>
多くのWebサイトはGoogle Analyticsなどのトラッカーを利用しています。
このようなサービスを利用し、ユーザに必要とされている情報を解析、提供することはユーザや提供者相互にメリットがあることです。
が、Googleなどの大企業のサービスを熟考なく導入することは大企業による寡占を進めます。
</p>

<p>
たとえば、iHerbというサプリメントの通販サイトを閲覧した直後に、Web広告が表示されるサイトを用いてプレゼンテーションを行なうと、
Web広告が殆どiHerbのサプリメントの広告になってしまい聴講者は集中できないばかりか発表者に関するセンシティブな情報が知られてしまうかもしれません。
(GoogleやiHerbが悪いサイトというわけではありません。)
</p>

<p>
たしかに、必要な人に必要な情報を表示することはメリットしかないことですが、Webサイトの閲覧履歴という思想や興味など重度の個人情報を数少ない企業が握ることは危険なことだと思います。
数少ない企業が突然evilになるかもしれないし、企業が籍を持つ国が情報統制を敷くためにあらゆる手段で世界中の人の思想を収集する法律を作り、企業が握った個人情報を接収するかもしれません。
</p>

<p>
企業がサービスを行なうサイトは開発工数や使いやすさで利益のために大企業のサービスを導入することも良いとおもいます。
</p>

<p>
しかし、これは折角自分で運用するブログなので、リクエストログだけでどれくらいのアクセス解析ができるのか試そうという意図もあり、ブログを自営することにしました。
</p>
</div>
</div>

<div id="outline-container-org1fcd90e" class="outline-4">
<h4 id="org1fcd90e">広告運用</h4>
<div class="outline-text-4" id="text-org1fcd90e">
<p>
広告運用のプラットフォームを自作してみようっかなとおもってます。
後々。。。。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb2215d4" class="outline-2">
<h2 id="orgb2215d4">自分について</h2>
<div class="outline-text-2" id="text-orgb2215d4">
<p>
<a href="http://cv.baud.jp">履歴書？</a>
</p>

<p>
詳しいことや採用の方は↑のリンク先をチェックしてください。
学生身分ですが、お仕事をさがしています。
</p>

<p>
国立東京高専を卒業して放送大学で大学院にいくための単位をあつめようとしています。
大学院ではインターネットの非中央集権的なアーキテクチャを生かした研究をしたいです。(まだ未熟なので詳しくは直接聞いてほしい~)
</p>

<p>
足の靭帯の張力を測ったりする研究なんかもしてます。
</p>


<p>
インターネットにコンピュータを繋ぐことで世界と繋がれることに感動してからネットワークが趣味になりました。(ネットワークビジネスのことではない。)
</p>

<p>
インターネットの素晴らしいとおもったところについては話すと長くなるので聞きたい人は会ったときに覚悟して聞いてください。
L2~L4らへんが好きです。
</p>

<p>
海外旅行が好きで良くいきます。
おすすめはバルセロナ。
</p>

<p>
車も好き。あとはお酒
</p>
</div>
</div>

<div id="outline-container-org4e1809a" class="outline-2">
<h2 id="org4e1809a">LICENSE</h2>
<div class="outline-text-2" id="text-org4e1809a">
<p>
このサイトにあるコードとか文章は特記ない場合CC0/Beerwareです。
著作権などは主張しないので煮るなり焼くなりすきにしてください。
</p>

<p>
この文章を読むすべての人は僕にビールをおごることができます。
</p>

<p>
役にたった場合は教えてくれると非常によろこびます。
</p>
</div>
</div>

<div id="outline-container-org31b3bda" class="outline-2">
<h2 id="org31b3bda">POSIX-shell縛りのスクリプトでCMSを作ってみた。</h2>
<div class="outline-text-2" id="text-org31b3bda">
<p>
最後にこのブログの動いてるシステムの簡単な説明です。
詳しくはまたこんど書きます。
</p>

<p>
このブログシステム(CMS?)は、POSIXで定義されているコマンドとそのオプションを使ってつくられています。
POSIXで定義されているコマンドとそのオプションだけで作ることで高い移植性と環境構築が簡単なところに魅力を感じて言語を選択しました。
</p>

<p>
リポジトリは<a href="https://github.com/yosatak/weblog">ここ</a>です。
</p>
</div>

<div id="outline-container-org81b328f" class="outline-3">
<h3 id="org81b328f">実行環境</h3>
<div class="outline-text-3" id="text-org81b328f">
<p>
weblog.baud.jpは自宅マンションでうごくFreeBSD on RaspberryPi2でホスティングされています。(2019/3/12現在)
httpサーバにはOpenBSDhttpdを使っています。
</p>

<p>
システム自体はシェルスクリプトなのでPOSIXに準拠したコンピュータとCGIが使える適当なhttpサーバがあればわりとどの環境でもうごくはず。
</p>

<p>
OpenBSD httpdを利用しているのは僕が普段のメインマシンがOpenBSDでそれに元々はいっていたからでFreeBSDを使っているのはraspberry piに挿さっていたSDカードに焼かれていたのがFreeBSDだからで深い理由はありません。
</p>

<p>
もし、同じCMSを使いたい人は好きなOSに好きなHTTPサーバを入れてつかってみてください。
</p>

<p>
このシステムに関しての説明は後日します。
</p>
</div>
</div>
</div>
